{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/sme3.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}17 Aug 2021, 23:45:17
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. cd "~/Downloads/LSHTMlearningnote/backupfiles/"
{res}/Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. use trinmlsh
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. describe

{txt}Contains data from {res}trinmlsh.dta
{txt}  obs:{res}           318                          
{txt} vars:{res}            18                          14 Sep 1999 11:20
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:ethgp          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:lethgp   }{bind:  }{res}{res}Ethnic group{p_end}
{p 0 48}{bind:ageent         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Age in years at first survey{p_end}
{p 0 48}{bind:death          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Died from any cause{p_end}
{p 0 48}{bind:cvdeath        }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res} Died from CV disease{p_end}
{p 0 48}{bind:alc            }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:lalc     }{bind:  }{res}{res}drinks per week{p_end}
{p 0 48}{bind:smokenum       }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:lsmokn   }{bind:  }{res}{res}No. of cigarettes per day{p_end}
{p 0 48}{bind:hdlc           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}HDL cholesterol{p_end}
{p 0 48}{bind:diabp          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Diastolic blood pressure{p_end}
{p 0 48}{bind:sysbp          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Systolic blood pressure{p_end}
{p 0 48}{bind:chdstart       }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Heart disease at time of entry{p_end}
{p 0 48}{bind:days           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:years          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:bmi            }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:id             }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:timein         }{txt}{bind: float   }{bind:{txt}%d        }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:timeout        }{txt}{bind: float   }{bind:{txt}%d        }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:y              }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:timebth        }{txt}{bind: float   }{bind:{txt}%d        }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: 

{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. sum

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}ethgp {c |}{res}        318    2.103774    1.347477          1          5
{txt}{space 6}ageent {c |}{res}        318    65.09343     3.19148     60.005      73.93
{txt}{space 7}death {c |}{res}        318    .2767296    .4480867          0          1
{txt}{space 5}cvdeath {c |}{res}        318    .0691824     .254164          0          1
{txt}{space 9}alc {c |}{res}        318    1.031447    1.111576          0          3
{txt}{hline 13}{c +}{hline 57}
{space 4}smokenum {c |}{res}        317    1.388013    1.649007          0          5
{txt}{space 8}hdlc {c |}{res}        301    .9880432    .3728258       .185      2.411
{txt}{space 7}diabp {c |}{res}        314    91.08917    15.12942         55        159
{txt}{space 7}sysbp {c |}{res}        314    154.8121    28.18775         95        243
{txt}{space 4}chdstart {c |}{res}        290    .1310345    .3380214          0          1
{txt}{hline 13}{c +}{hline 57}
{space 8}days {c |}{res}        318    2532.101    940.5925          6       3579
{txt}{space 7}years {c |}{res}        318    6.932514    2.575202   .0164271   9.798768
{txt}{space 9}bmi {c |}{res}        283    23.25392    4.174109      11.25      36.38
{txt}{space 10}id {c |}{res}        318       159.5    91.94292          1        318
{txt}{space 6}timein {c |}{res}        318        6210           0       6210       6210
{txt}{hline 13}{c +}{hline 57}
{space 5}timeout {c |}{res}        318    8742.101    940.5925       6216       9789
{txt}{space 11}y {c |}{res}        318    6.932514    2.575202   .0164271   9.798768
{txt}{space 5}timebth {c |}{res}        318   -17565.37    1165.688  -20792.93  -15706.83
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. help trinmlsh
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. help trinmlsh
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. stset timeout, fail(death) origin(timein) enter(timein) scale(365.25) id(id)

                {txt}id:  {res}id
     {txt}failure event:  {res}death != 0 & death < .
{txt}obs. time interval:  {res}(timeout[_n-1], timeout]
{txt} enter on or after:  {res}time timein
{txt} exit on or before:  {res}failure
    {txt}t for analysis:  {res}(time-origin)/365.25
            {txt}origin:  {res}time timein

{txt}{hline 78}
{res}        318{txt}  total observations
{res}          0{txt}  exclusions
{hline 78}
{res}        318{txt}  observations remaining, representing
{res}        318{txt}  subjects
{res}         88{txt}  failures in single-failure-per-subject data
{res}  2,204.539{txt}  total analysis time at risk and under observation
                                                at risk from t = {res}        0
                                     {txt}earliest observed entry t = {res}        0
                                          {txt}last observed exit t = {res} 9.798768
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. sts graph, saving(plot1)

         {txt}failure _d:  {res}death
   {txt}analysis time _t:  {res}(timeout-origin)/365.25
             {txt}origin:  {res}time timein
{txt}  enter on or after:  {res}time timein
                 {txt}id:  {res}id
{txt}(file plot1.gph saved)
{res}{txt}
{com}. 
{txt}end of do-file

{com}. graph save "Graph" "/Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/plot1.gph", replace
{res}{txt}(file /Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/plot1.gph saved)

{com}. graph export "/Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/plot1.jpg", as(jpg) name("Graph") quality(100)
{txt}(file /Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/plot1.jpg written in JPG format)

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/sme3.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}18 Aug 2021, 00:11:46
{txt}{.-}
{smcl}
{txt}{sf}{ul off}{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/sme3.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}19 Aug 2021, 23:50:50
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. * Q1
. use trinmlsh
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. describe

{txt}Contains data from {res}trinmlsh.dta
{txt}  obs:{res}           318                          
{txt} vars:{res}            18                          14 Sep 1999 11:20
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:ethgp          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:lethgp   }{bind:  }{res}{res}Ethnic group{p_end}
{p 0 48}{bind:ageent         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Age in years at first survey{p_end}
{p 0 48}{bind:death          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Died from any cause{p_end}
{p 0 48}{bind:cvdeath        }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res} Died from CV disease{p_end}
{p 0 48}{bind:alc            }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:lalc     }{bind:  }{res}{res}drinks per week{p_end}
{p 0 48}{bind:smokenum       }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:lsmokn   }{bind:  }{res}{res}No. of cigarettes per day{p_end}
{p 0 48}{bind:hdlc           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}HDL cholesterol{p_end}
{p 0 48}{bind:diabp          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Diastolic blood pressure{p_end}
{p 0 48}{bind:sysbp          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Systolic blood pressure{p_end}
{p 0 48}{bind:chdstart       }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Heart disease at time of entry{p_end}
{p 0 48}{bind:days           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:years          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:bmi            }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:id             }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:timein         }{txt}{bind: float   }{bind:{txt}%d        }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:timeout        }{txt}{bind: float   }{bind:{txt}%d        }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:y              }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:timebth        }{txt}{bind: float   }{bind:{txt}%d        }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: 

{com}. sum

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}ethgp {c |}{res}        318    2.103774    1.347477          1          5
{txt}{space 6}ageent {c |}{res}        318    65.09343     3.19148     60.005      73.93
{txt}{space 7}death {c |}{res}        318    .2767296    .4480867          0          1
{txt}{space 5}cvdeath {c |}{res}        318    .0691824     .254164          0          1
{txt}{space 9}alc {c |}{res}        318    1.031447    1.111576          0          3
{txt}{hline 13}{c +}{hline 57}
{space 4}smokenum {c |}{res}        317    1.388013    1.649007          0          5
{txt}{space 8}hdlc {c |}{res}        301    .9880432    .3728258       .185      2.411
{txt}{space 7}diabp {c |}{res}        314    91.08917    15.12942         55        159
{txt}{space 7}sysbp {c |}{res}        314    154.8121    28.18775         95        243
{txt}{space 4}chdstart {c |}{res}        290    .1310345    .3380214          0          1
{txt}{hline 13}{c +}{hline 57}
{space 8}days {c |}{res}        318    2532.101    940.5925          6       3579
{txt}{space 7}years {c |}{res}        318    6.932514    2.575202   .0164271   9.798768
{txt}{space 9}bmi {c |}{res}        283    23.25392    4.174109      11.25      36.38
{txt}{space 10}id {c |}{res}        318       159.5    91.94292          1        318
{txt}{space 6}timein {c |}{res}        318        6210           0       6210       6210
{txt}{hline 13}{c +}{hline 57}
{space 5}timeout {c |}{res}        318    8742.101    940.5925       6216       9789
{txt}{space 11}y {c |}{res}        318    6.932514    2.575202   .0164271   9.798768
{txt}{space 5}timebth {c |}{res}        318   -17565.37    1165.688  -20792.93  -15706.83
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. help trinmlsh
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. stset timeout, fail(death) origin(timein) enter(timein) scale(365.25) id(id)

                {txt}id:  {res}id
     {txt}failure event:  {res}death != 0 & death < .
{txt}obs. time interval:  {res}(timeout[_n-1], timeout]
{txt} enter on or after:  {res}time timein
{txt} exit on or before:  {res}failure
    {txt}t for analysis:  {res}(time-origin)/365.25
            {txt}origin:  {res}time timein

{txt}{hline 78}
{res}        318{txt}  total observations
{res}          0{txt}  exclusions
{hline 78}
{res}        318{txt}  observations remaining, representing
{res}        318{txt}  subjects
{res}         88{txt}  failures in single-failure-per-subject data
{res}  2,204.539{txt}  total analysis time at risk and under observation
                                                at risk from t = {res}        0
                                     {txt}earliest observed entry t = {res}        0
                                          {txt}last observed exit t = {res} 9.798768
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. sts list, at(1, 3, 5)

         {txt}failure _d:  {res}death
   {txt}analysis time _t:  {res}(timeout-origin)/365.25
             {txt}origin:  {res}time timein
{txt}  enter on or after:  {res}time timein
                 {txt}id:  {res}id

{txt}{col 15}Beg.{col 41}Survivor{col 55}Std.
    Time     Total     Fail{col 41}Function     Error     [95% Conf. Int.]
{hline 79}
       1  {res}     303       16              0.9497    0.0123     0.9192    0.9689
{txt}       3  {res}     284       18              0.8930    0.0173     0.8536    0.9224
{txt}       5  {res}     256       26              0.8107    0.0220     0.7630    0.8497
{txt}{hline 79}
{p 0 6 2 81}
Note: Survivor function is calculated over full data and evaluated at
indicated times; it is not calculated from aggregates shown at left.
{p_end}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. sts graph, ci saving(plot1, replace)

         {txt}failure _d:  {res}death
   {txt}analysis time _t:  {res}(timeout-origin)/365.25
             {txt}origin:  {res}time timein
{txt}  enter on or after:  {res}time timein
                 {txt}id:  {res}id
{txt}(file plot1.gph saved)
{res}{txt}
{com}. 
{txt}end of do-file

{com}. graph save "Graph" "/Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/plot1.gph", replace
{res}{txt}(file /Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/plot1.gph saved)

{com}. graph export "/Users/chaoimacmini/Downloads/LSHTMlearningnote/img/plot1_ci.jpg", as(jpg) name("Graph") quality(100)
{txt}(file /Users/chaoimacmini/Downloads/LSHTMlearningnote/img/plot1_ci.jpg written in JPG format)

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. table smokenum

{txt}{hline 10}{c TT}{hline 11}
No. of    {c |}
cigarette {c |}
s per day {c |}      Freq.
{hline 10}{c +}{hline 11}
 non-smok {c |}        {res}140
 {txt}ex-smoke {c |}         {res}68
 {txt}1-9 cigs {c |}         {res}29
 {txt}10-19 ci {c |}         {res}30
 {txt}20-29 ci {c |}         {res}26
 {txt}30+ cigs {c |}         {res}24
{txt}{hline 10}{c BT}{hline 11}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. table smokenum, nolabel
{err}option {bf:nolabel} not allowed
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. tab smokenum

     {txt}No. of {c |}
 cigarettes {c |}
    per day {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   non-smok {c |}{res}        140       44.16       44.16
{txt}   ex-smoke {c |}{res}         68       21.45       65.62
{txt}   1-9 cigs {c |}{res}         29        9.15       74.76
{txt}   10-19 ci {c |}{res}         30        9.46       84.23
{txt}   20-29 ci {c |}{res}         26        8.20       92.43
{txt}   30+ cigs {c |}{res}         24        7.57      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        317      100.00
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. tab smokenum, nolabel

     {txt}No. of {c |}
 cigarettes {c |}
    per day {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        140       44.16       44.16
{txt}          1 {c |}{res}         68       21.45       65.62
{txt}          2 {c |}{res}         29        9.15       74.76
{txt}          3 {c |}{res}         30        9.46       84.23
{txt}          4 {c |}{res}         26        8.20       92.43
{txt}          5 {c |}{res}         24        7.57      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        317      100.00
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. gen smokstatus = smokenum >= 2 if smokenum != .
{txt}(1 missing value generated)

{com}. label define smokstatus 0 "non-smokers" 1 "current smokers"
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. label value smokstatus smokstatus
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. sts graph, by(smokstatus)

         {txt}failure _d:  {res}death
   {txt}analysis time _t:  {res}(timeout-origin)/365.25
             {txt}origin:  {res}time timein
{txt}  enter on or after:  {res}time timein
                 {txt}id:  {res}id
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. sts graph, by(smokstatus)

         {txt}failure _d:  {res}death
   {txt}analysis time _t:  {res}(timeout-origin)/365.25
             {txt}origin:  {res}time timein
{txt}  enter on or after:  {res}time timein
                 {txt}id:  {res}id
{txt}
{com}. 
{txt}end of do-file

{com}. graph export "/Users/chaoimacmini/Downloads/LSHTMlearningnote/img/plot3_1.jpg", as(jpg) name("Graph") quality(100)
{txt}(file /Users/chaoimacmini/Downloads/LSHTMlearningnote/img/plot3_1.jpg written in JPG format)

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. sts test smokstatus

         {txt}failure _d:  {res}death
   {txt}analysis time _t:  {res}(timeout-origin)/365.25
             {txt}origin:  {res}time timein
{txt}  enter on or after:  {res}time timein
                 {txt}id:  {res}id


{txt}{title:Log-rank test for equality of survivor functions}

{col 16} {c |}   Events         Events
smokstatus      {c |}  observed       expected
{hline 16}{c +}{hline 25}
non-smokers     {c |}{res}        48          57.86
{txt}current smokers {c |}{res}        40          30.14
{txt}{hline 16}{c +}{hline 25}
Total           {c |}{res}        88          88.00

                      {txt}chi2(1) = {res}      4.91
                      {txt}Pr>chi2 = {res}    0.0267
{txt}
{com}. 
{txt}end of do-file

{com}. 