{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/sme3.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}17 Aug 2021, 23:45:17
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. cd "~/Downloads/LSHTMlearningnote/backupfiles/"
{res}/Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. use trinmlsh
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. describe

{txt}Contains data from {res}trinmlsh.dta
{txt}  obs:{res}           318                          
{txt} vars:{res}            18                          14 Sep 1999 11:20
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:ethgp          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:lethgp   }{bind:  }{res}{res}Ethnic group{p_end}
{p 0 48}{bind:ageent         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Age in years at first survey{p_end}
{p 0 48}{bind:death          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Died from any cause{p_end}
{p 0 48}{bind:cvdeath        }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res} Died from CV disease{p_end}
{p 0 48}{bind:alc            }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:lalc     }{bind:  }{res}{res}drinks per week{p_end}
{p 0 48}{bind:smokenum       }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:lsmokn   }{bind:  }{res}{res}No. of cigarettes per day{p_end}
{p 0 48}{bind:hdlc           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}HDL cholesterol{p_end}
{p 0 48}{bind:diabp          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Diastolic blood pressure{p_end}
{p 0 48}{bind:sysbp          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Systolic blood pressure{p_end}
{p 0 48}{bind:chdstart       }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Heart disease at time of entry{p_end}
{p 0 48}{bind:days           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:years          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:bmi            }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:id             }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:timein         }{txt}{bind: float   }{bind:{txt}%d        }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:timeout        }{txt}{bind: float   }{bind:{txt}%d        }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:y              }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:timebth        }{txt}{bind: float   }{bind:{txt}%d        }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: 

{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. sum

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}ethgp {c |}{res}        318    2.103774    1.347477          1          5
{txt}{space 6}ageent {c |}{res}        318    65.09343     3.19148     60.005      73.93
{txt}{space 7}death {c |}{res}        318    .2767296    .4480867          0          1
{txt}{space 5}cvdeath {c |}{res}        318    .0691824     .254164          0          1
{txt}{space 9}alc {c |}{res}        318    1.031447    1.111576          0          3
{txt}{hline 13}{c +}{hline 57}
{space 4}smokenum {c |}{res}        317    1.388013    1.649007          0          5
{txt}{space 8}hdlc {c |}{res}        301    .9880432    .3728258       .185      2.411
{txt}{space 7}diabp {c |}{res}        314    91.08917    15.12942         55        159
{txt}{space 7}sysbp {c |}{res}        314    154.8121    28.18775         95        243
{txt}{space 4}chdstart {c |}{res}        290    .1310345    .3380214          0          1
{txt}{hline 13}{c +}{hline 57}
{space 8}days {c |}{res}        318    2532.101    940.5925          6       3579
{txt}{space 7}years {c |}{res}        318    6.932514    2.575202   .0164271   9.798768
{txt}{space 9}bmi {c |}{res}        283    23.25392    4.174109      11.25      36.38
{txt}{space 10}id {c |}{res}        318       159.5    91.94292          1        318
{txt}{space 6}timein {c |}{res}        318        6210           0       6210       6210
{txt}{hline 13}{c +}{hline 57}
{space 5}timeout {c |}{res}        318    8742.101    940.5925       6216       9789
{txt}{space 11}y {c |}{res}        318    6.932514    2.575202   .0164271   9.798768
{txt}{space 5}timebth {c |}{res}        318   -17565.37    1165.688  -20792.93  -15706.83
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. help trinmlsh
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. help trinmlsh
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. stset timeout, fail(death) origin(timein) enter(timein) scale(365.25) id(id)

                {txt}id:  {res}id
     {txt}failure event:  {res}death != 0 & death < .
{txt}obs. time interval:  {res}(timeout[_n-1], timeout]
{txt} enter on or after:  {res}time timein
{txt} exit on or before:  {res}failure
    {txt}t for analysis:  {res}(time-origin)/365.25
            {txt}origin:  {res}time timein

{txt}{hline 78}
{res}        318{txt}  total observations
{res}          0{txt}  exclusions
{hline 78}
{res}        318{txt}  observations remaining, representing
{res}        318{txt}  subjects
{res}         88{txt}  failures in single-failure-per-subject data
{res}  2,204.539{txt}  total analysis time at risk and under observation
                                                at risk from t = {res}        0
                                     {txt}earliest observed entry t = {res}        0
                                          {txt}last observed exit t = {res} 9.798768
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. sts graph, saving(plot1)

         {txt}failure _d:  {res}death
   {txt}analysis time _t:  {res}(timeout-origin)/365.25
             {txt}origin:  {res}time timein
{txt}  enter on or after:  {res}time timein
                 {txt}id:  {res}id
{txt}(file plot1.gph saved)
{res}{txt}
{com}. 
{txt}end of do-file

{com}. graph save "Graph" "/Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/plot1.gph", replace
{res}{txt}(file /Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/plot1.gph saved)

{com}. graph export "/Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/plot1.jpg", as(jpg) name("Graph") quality(100)
{txt}(file /Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/plot1.jpg written in JPG format)

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/sme3.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}18 Aug 2021, 00:11:46
{txt}{.-}
{smcl}
{txt}{sf}{ul off}{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/sme3.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}19 Aug 2021, 23:50:50
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. * Q1
. use trinmlsh
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. describe

{txt}Contains data from {res}trinmlsh.dta
{txt}  obs:{res}           318                          
{txt} vars:{res}            18                          14 Sep 1999 11:20
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:ethgp          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:lethgp   }{bind:  }{res}{res}Ethnic group{p_end}
{p 0 48}{bind:ageent         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Age in years at first survey{p_end}
{p 0 48}{bind:death          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Died from any cause{p_end}
{p 0 48}{bind:cvdeath        }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res} Died from CV disease{p_end}
{p 0 48}{bind:alc            }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:lalc     }{bind:  }{res}{res}drinks per week{p_end}
{p 0 48}{bind:smokenum       }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:lsmokn   }{bind:  }{res}{res}No. of cigarettes per day{p_end}
{p 0 48}{bind:hdlc           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}HDL cholesterol{p_end}
{p 0 48}{bind:diabp          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Diastolic blood pressure{p_end}
{p 0 48}{bind:sysbp          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Systolic blood pressure{p_end}
{p 0 48}{bind:chdstart       }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Heart disease at time of entry{p_end}
{p 0 48}{bind:days           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:years          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:bmi            }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:id             }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:timein         }{txt}{bind: float   }{bind:{txt}%d        }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:timeout        }{txt}{bind: float   }{bind:{txt}%d        }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:y              }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:timebth        }{txt}{bind: float   }{bind:{txt}%d        }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: 

{com}. sum

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}ethgp {c |}{res}        318    2.103774    1.347477          1          5
{txt}{space 6}ageent {c |}{res}        318    65.09343     3.19148     60.005      73.93
{txt}{space 7}death {c |}{res}        318    .2767296    .4480867          0          1
{txt}{space 5}cvdeath {c |}{res}        318    .0691824     .254164          0          1
{txt}{space 9}alc {c |}{res}        318    1.031447    1.111576          0          3
{txt}{hline 13}{c +}{hline 57}
{space 4}smokenum {c |}{res}        317    1.388013    1.649007          0          5
{txt}{space 8}hdlc {c |}{res}        301    .9880432    .3728258       .185      2.411
{txt}{space 7}diabp {c |}{res}        314    91.08917    15.12942         55        159
{txt}{space 7}sysbp {c |}{res}        314    154.8121    28.18775         95        243
{txt}{space 4}chdstart {c |}{res}        290    .1310345    .3380214          0          1
{txt}{hline 13}{c +}{hline 57}
{space 8}days {c |}{res}        318    2532.101    940.5925          6       3579
{txt}{space 7}years {c |}{res}        318    6.932514    2.575202   .0164271   9.798768
{txt}{space 9}bmi {c |}{res}        283    23.25392    4.174109      11.25      36.38
{txt}{space 10}id {c |}{res}        318       159.5    91.94292          1        318
{txt}{space 6}timein {c |}{res}        318        6210           0       6210       6210
{txt}{hline 13}{c +}{hline 57}
{space 5}timeout {c |}{res}        318    8742.101    940.5925       6216       9789
{txt}{space 11}y {c |}{res}        318    6.932514    2.575202   .0164271   9.798768
{txt}{space 5}timebth {c |}{res}        318   -17565.37    1165.688  -20792.93  -15706.83
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. help trinmlsh
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. stset timeout, fail(death) origin(timein) enter(timein) scale(365.25) id(id)

                {txt}id:  {res}id
     {txt}failure event:  {res}death != 0 & death < .
{txt}obs. time interval:  {res}(timeout[_n-1], timeout]
{txt} enter on or after:  {res}time timein
{txt} exit on or before:  {res}failure
    {txt}t for analysis:  {res}(time-origin)/365.25
            {txt}origin:  {res}time timein

{txt}{hline 78}
{res}        318{txt}  total observations
{res}          0{txt}  exclusions
{hline 78}
{res}        318{txt}  observations remaining, representing
{res}        318{txt}  subjects
{res}         88{txt}  failures in single-failure-per-subject data
{res}  2,204.539{txt}  total analysis time at risk and under observation
                                                at risk from t = {res}        0
                                     {txt}earliest observed entry t = {res}        0
                                          {txt}last observed exit t = {res} 9.798768
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. sts list, at(1, 3, 5)

         {txt}failure _d:  {res}death
   {txt}analysis time _t:  {res}(timeout-origin)/365.25
             {txt}origin:  {res}time timein
{txt}  enter on or after:  {res}time timein
                 {txt}id:  {res}id

{txt}{col 15}Beg.{col 41}Survivor{col 55}Std.
    Time     Total     Fail{col 41}Function     Error     [95% Conf. Int.]
{hline 79}
       1  {res}     303       16              0.9497    0.0123     0.9192    0.9689
{txt}       3  {res}     284       18              0.8930    0.0173     0.8536    0.9224
{txt}       5  {res}     256       26              0.8107    0.0220     0.7630    0.8497
{txt}{hline 79}
{p 0 6 2 81}
Note: Survivor function is calculated over full data and evaluated at
indicated times; it is not calculated from aggregates shown at left.
{p_end}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. sts graph, ci saving(plot1, replace)

         {txt}failure _d:  {res}death
   {txt}analysis time _t:  {res}(timeout-origin)/365.25
             {txt}origin:  {res}time timein
{txt}  enter on or after:  {res}time timein
                 {txt}id:  {res}id
{txt}(file plot1.gph saved)
{res}{txt}
{com}. 
{txt}end of do-file

{com}. graph save "Graph" "/Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/plot1.gph", replace
{res}{txt}(file /Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/plot1.gph saved)

{com}. graph export "/Users/chaoimacmini/Downloads/LSHTMlearningnote/img/plot1_ci.jpg", as(jpg) name("Graph") quality(100)
{txt}(file /Users/chaoimacmini/Downloads/LSHTMlearningnote/img/plot1_ci.jpg written in JPG format)

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. table smokenum

{txt}{hline 10}{c TT}{hline 11}
No. of    {c |}
cigarette {c |}
s per day {c |}      Freq.
{hline 10}{c +}{hline 11}
 non-smok {c |}        {res}140
 {txt}ex-smoke {c |}         {res}68
 {txt}1-9 cigs {c |}         {res}29
 {txt}10-19 ci {c |}         {res}30
 {txt}20-29 ci {c |}         {res}26
 {txt}30+ cigs {c |}         {res}24
{txt}{hline 10}{c BT}{hline 11}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. table smokenum, nolabel
{err}option {bf:nolabel} not allowed
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. tab smokenum

     {txt}No. of {c |}
 cigarettes {c |}
    per day {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
   non-smok {c |}{res}        140       44.16       44.16
{txt}   ex-smoke {c |}{res}         68       21.45       65.62
{txt}   1-9 cigs {c |}{res}         29        9.15       74.76
{txt}   10-19 ci {c |}{res}         30        9.46       84.23
{txt}   20-29 ci {c |}{res}         26        8.20       92.43
{txt}   30+ cigs {c |}{res}         24        7.57      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        317      100.00
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. tab smokenum, nolabel

     {txt}No. of {c |}
 cigarettes {c |}
    per day {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        140       44.16       44.16
{txt}          1 {c |}{res}         68       21.45       65.62
{txt}          2 {c |}{res}         29        9.15       74.76
{txt}          3 {c |}{res}         30        9.46       84.23
{txt}          4 {c |}{res}         26        8.20       92.43
{txt}          5 {c |}{res}         24        7.57      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        317      100.00
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. gen smokstatus = smokenum >= 2 if smokenum != .
{txt}(1 missing value generated)

{com}. label define smokstatus 0 "non-smokers" 1 "current smokers"
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. label value smokstatus smokstatus
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. sts graph, by(smokstatus)

         {txt}failure _d:  {res}death
   {txt}analysis time _t:  {res}(timeout-origin)/365.25
             {txt}origin:  {res}time timein
{txt}  enter on or after:  {res}time timein
                 {txt}id:  {res}id
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. sts graph, by(smokstatus)

         {txt}failure _d:  {res}death
   {txt}analysis time _t:  {res}(timeout-origin)/365.25
             {txt}origin:  {res}time timein
{txt}  enter on or after:  {res}time timein
                 {txt}id:  {res}id
{txt}
{com}. 
{txt}end of do-file

{com}. graph export "/Users/chaoimacmini/Downloads/LSHTMlearningnote/img/plot3_1.jpg", as(jpg) name("Graph") quality(100)
{txt}(file /Users/chaoimacmini/Downloads/LSHTMlearningnote/img/plot3_1.jpg written in JPG format)

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. sts test smokstatus

         {txt}failure _d:  {res}death
   {txt}analysis time _t:  {res}(timeout-origin)/365.25
             {txt}origin:  {res}time timein
{txt}  enter on or after:  {res}time timein
                 {txt}id:  {res}id


{txt}{title:Log-rank test for equality of survivor functions}

{col 16} {c |}   Events         Events
smokstatus      {c |}  observed       expected
{hline 16}{c +}{hline 25}
non-smokers     {c |}{res}        48          57.86
{txt}current smokers {c |}{res}        40          30.14
{txt}{hline 16}{c +}{hline 25}
Total           {c |}{res}        88          88.00

                      {txt}chi2(1) = {res}      4.91
                      {txt}Pr>chi2 = {res}    0.0267
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. use mortality, clear
{err}{p 0 4 2}
file mortality.dta
not found
{p_end}
{txt}{search r(601), local:r(601);}

end of do-file

{search r(601), local:r(601);}

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. use mortality, clear
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. help mortality
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. describe mortality
{err}variable {bf}mortality{sf} not found
{txt}{search r(111), local:r(111);}

end of do-file

{search r(111), local:r(111);}

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. describe

{txt}Contains data from {res}mortality.dta
{txt}  obs:{res}         4,298                          
{txt} vars:{res}            28                          23 Oct 2013 11:45
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:id             }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Individual ID{p_end}
{p 0 48}{bind:area           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:area     }{bind:  }{res}{res}Area{p_end}
{p 0 48}{bind:district       }{txt}{bind: str7    }{bind:{txt}%7s       }{space 1}{bind:         }{bind:  }{res}{res}District{p_end}
{p 0 48}{bind:vcode          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Village ID{p_end}
{p 0 48}{bind:compound_size  }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Compound size{p_end}
{p 0 48}{bind:age            }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Age in years{p_end}
{p 0 48}{bind:sex            }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:sex      }{bind:  }{res}{res}Sex{p_end}
{p 0 48}{bind:ethnic         }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:ethnic   }{bind:  }{res}{res}Ethnic{p_end}
{p 0 48}{bind:religion       }{txt}{bind: byte    }{bind:{txt}%11.0g    }{space 1}{bind:religion }{bind:  }{res}{res}Religion{p_end}
{p 0 48}{bind:occupation     }{txt}{bind: byte    }{bind:{txt}%27.0g    }{space 1}{txt}occupation{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Occupation{p_end}
{p 0 48}{bind:education      }{txt}{bind: byte    }{bind:{txt}%22.0g    }{space 1}{txt}education{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Education{p_end}
{p 0 48}{bind:mfpermg        }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Microfilarial load per mg{p_end}
{p 0 48}{bind:vimp           }{txt}{bind: float   }{bind:{txt}%17.0g    }{space 1}{bind:vimp     }{bind:  }{res}{res}Visually impaired{p_end}
{p 0 48}{bind:died           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Died{p_end}
{p 0 48}{bind:systolic       }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Systolic BP (mmHg){p_end}
{p 0 48}{bind:diastolic      }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Diastolic BP (mmHg){p_end}
{p 0 48}{bind:pulse          }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Pulse rate/minute{p_end}
{p 0 48}{bind:weight         }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Weight (kgs){p_end}
{p 0 48}{bind:height         }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Height (cms){p_end}
{p 0 48}{bind:map            }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Mean Arterial Pressure{p_end}
{p 0 48}{bind:bmi            }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}BMI{p_end}
{p 0 48}{bind:agegrp         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:agegrp   }{bind:  }{res}{res}Age group (years){p_end}
{p 0 48}{bind:mfgrp          }{txt}{bind: float   }{bind:{txt}%10.0g    }{space 1}{bind:mfgrp    }{bind:  }{res}{res}Microfilarial load/mg (grouped){p_end}
{p 0 48}{bind:mfpos          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Microfilarial infection{p_end}
{p 0 48}{bind:agebin         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:agebin   }{bind:  }{res}{res}Age (2 groups){p_end}
{p 0 48}{bind:bmigrp         }{txt}{bind: float   }{bind:{txt}%12.0g    }{space 1}{bind:bmigrp   }{bind:  }{res}{res}BMI (3 groups){p_end}
{p 0 48}{bind:enter          }{txt}{bind: long    }{bind:{txt}%dD_m_Y   }{space 1}{bind:         }{bind:  }{res}{res}Date of entry to study{p_end}
{p 0 48}{bind:exit           }{txt}{bind: float   }{bind:{txt}%dD_m_Y   }{space 1}{bind:         }{bind:  }{res}{res}Date of exit from study{p_end}
{txt}{hline}
Sorted by: {res}id
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. gen hyper = .
{txt}(4,298 missing values generated)

{com}. replace hyper = 0 if systolic < 140
{txt}(3,747 real changes made)

{com}. replace hyper = 1 if systolic >= 140 & systolic != .
{txt}(516 real changes made)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. stset exit, failure(died), enter(enter), origin(enter) id(id) scale(365.25)
{err}invalid 'enter' 
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. stset exit, failure(died) enter(enter), origin(enter) id(id) scale(365.25)
{err}invalid 'origin' 
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. stset exit, failure(died) enter(enter) origin(enter) id(id) scale(365.25)

                {txt}id:  {res}id
     {txt}failure event:  {res}died != 0 & died < .
{txt}obs. time interval:  {res}(exit[_n-1], exit]
{txt} enter on or after:  {res}time enter
{txt} exit on or before:  {res}failure
    {txt}t for analysis:  {res}(time-origin)/365.25
            {txt}origin:  {res}time enter

{txt}{hline 78}
{res}      4,298{txt}  total observations
{res}          0{txt}  exclusions
{hline 78}
{res}      4,298{txt}  observations remaining, representing
{res}      4,298{txt}  subjects
{res}        137{txt}  failures in single-failure-per-subject data
{res} 11,457.357{txt}  total analysis time at risk and under observation
                                                at risk from t = {res}        0
                                     {txt}earliest observed entry t = {res}        0
                                          {txt}last observed exit t = {res} 3.249829
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. strate hyper, per(1000)

         {txt}failure _d:  {res}died
   {txt}analysis time _t:  {res}(exit-origin)/365.25
             {txt}origin:  {res}time enter
{txt}  enter on or after:  {res}time enter
                 {txt}id:  {res}id

{txt}Estimated failure rates
Number of records  =       {res}4263
{txt}
  {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 8}{c -}{hline 9}{c -}{hline 9}{c -}{hline 9}{c TRC}
  {c |} {res}hyper    D        Y      Rate     Lower     Upper {txt}{c |}
  {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c -}{hline 9}{c -}{hline 9}{c -}{hline 9}{c RT}
  {c |} {res}    0   94   9.9879    9.4114    7.6888   11.5199 {txt}{c |}
  {c |} {res}    1   40   1.3819   28.9456   21.2322   39.4611 {txt}{c |}
  {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 8}{c -}{hline 9}{c -}{hline 9}{c -}{hline 9}{c BRC}
   Notes: Rate = D/Y = failures/person-time (per 1000).
          Lower and Upper are bounds of 95% confidence intervals.


{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. stmh hyper

         {txt}failure _d:  {res}died
   {txt}analysis time _t:  {res}(exit-origin)/365.25
             {txt}origin:  {res}time enter
{txt}  enter on or after:  {res}time enter
                 {txt}id:  {res}id

{txt}Mantel-Haenszel estimate of the rate ratio
  comparing {res}hyper==1{txt} vs. {res}hyper==0

{txt}{col 1}{hline 72}
    Rate ratio         chi2         P>chi2          [95% Conf. Interval]
{col 1}{hline 72}
    {res}     3.076        39.30         0.0000              2.124      4.453
{txt}{col 1}{hline 72}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. browse
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. sts list if hyper == 1

         {txt}failure _d:  {res}died
   {txt}analysis time _t:  {res}(exit-origin)/365.25
             {txt}origin:  {res}time enter
{txt}  enter on or after:  {res}time enter
                 {txt}id:  {res}id

{txt}{col 14}At{col 27}{help j_stslist_netlost:Net}{col 34}Survivor{col 48}Std.
  Time     Risk   Fail   {help j_stslist_netlost:Lost}  {col 34}Function     Error     [95% Conf. Int.]
{hline 72}
   .23 {res}     516      1      0      0.9981    0.0019     0.9863    0.9997
{txt} .2533 {res}     515      1      0      0.9961    0.0027     0.9846    0.9990
{txt} .3559 {res}     514      1      0      0.9942    0.0033     0.9821    0.9981
{txt} .3587 {res}     513      0      1      0.9942    0.0033     0.9821    0.9981
{txt} .3669 {res}     512      0      1      0.9942    0.0033     0.9821    0.9981
{txt} .3723 {res}     511      1      0      0.9922    0.0039     0.9795    0.9971
{txt} .3792 {res}     510      1      0      0.9903    0.0043     0.9768    0.9959
{txt} .3888 {res}     509      1      0      0.9883    0.0047     0.9743    0.9947
{txt} .4298 {res}     508      1      0      0.9864    0.0051     0.9717    0.9935
{txt} .4353 {res}     507      0      1      0.9864    0.0051     0.9717    0.9935
{txt} .4408 {res}     506      1      0      0.9845    0.0055     0.9692    0.9922
{txt} .4846 {res}     505      2      0      0.9806    0.0061     0.9642    0.9895
{txt} .5421 {res}     503      0      1      0.9806    0.0061     0.9642    0.9895
{txt} .6886 {res}     502      0      1      0.9806    0.0061     0.9642    0.9895
{txt} .8378 {res}     501      0      1      0.9806    0.0061     0.9642    0.9895
{txt} .9363 {res}     500      0      1      0.9806    0.0061     0.9642    0.9895
{txt} .9514 {res}     499      0      1      0.9806    0.0061     0.9642    0.9895
{txt} 1.003 {res}     498      1      0      0.9786    0.0064     0.9617    0.9881
{txt} 1.012 {res}     497      0      1      0.9786    0.0064     0.9617    0.9881
{txt} 1.016 {res}     496      1      0      0.9766    0.0067     0.9592    0.9867
{txt} 1.047 {res}     495      1      0      0.9746    0.0069     0.9567    0.9852
{txt}  1.05 {res}     494      1      0      0.9727    0.0072     0.9543    0.9837
{txt} 1.055 {res}     493      0      1      0.9727    0.0072     0.9543    0.9837
{txt} 1.336 {res}     492      1      0      0.9707    0.0075     0.9519    0.9822
{txt} 1.377 {res}     491      1      0      0.9687    0.0077     0.9494    0.9807
{txt} 1.399 {res}     490      1      0      0.9667    0.0079     0.9470    0.9792
{txt} 1.418 {res}     489      0      1      0.9667    0.0079     0.9470    0.9792
{txt} 1.425 {res}     488      2      0      0.9628    0.0084     0.9423    0.9761
{txt} 1.477 {res}     486      0      1      0.9628    0.0084     0.9423    0.9761
{txt} 1.569 {res}     485      1      0      0.9608    0.0086     0.9399    0.9745
{txt} 1.574 {res}     484      1      0      0.9588    0.0088     0.9375    0.9729
{txt} 1.585 {res}     483      1      0      0.9568    0.0090     0.9352    0.9714
{txt} 1.619 {res}     482      1      0      0.9548    0.0092     0.9328    0.9698
{txt} 1.941 {res}     481      1      1      0.9528    0.0094     0.9305    0.9681
{txt} 2.029 {res}     479      1      0      0.9509    0.0096     0.9281    0.9665
{txt}  2.04 {res}     478      1      0      0.9489    0.0098     0.9258    0.9649
{txt} 2.277 {res}     477      0      1      0.9489    0.0098     0.9258    0.9649
{txt} 2.286 {res}     476      0      1      0.9489    0.0098     0.9258    0.9649
{txt} 2.289 {res}     475      1      0      0.9469    0.0100     0.9235    0.9633
{txt} 2.311 {res}     474      0      2      0.9469    0.0100     0.9235    0.9633
{txt} 2.313 {res}     472      0      3      0.9469    0.0100     0.9235    0.9633
{txt} 2.316 {res}     469      0      2      0.9469    0.0100     0.9235    0.9633
{txt} 2.319 {res}     467      0      5      0.9469    0.0100     0.9235    0.9633
{txt} 2.322 {res}     462      0      2      0.9469    0.0100     0.9235    0.9633
{txt} 2.326 {res}     460      1      0      0.9448    0.0101     0.9211    0.9616
{txt} 2.404 {res}     459      0      1      0.9448    0.0101     0.9211    0.9616
{txt} 2.407 {res}     458      0      2      0.9448    0.0101     0.9211    0.9616
{txt} 2.409 {res}     456      0      3      0.9448    0.0101     0.9211    0.9616
{txt} 2.412 {res}     453      0      7      0.9448    0.0101     0.9211    0.9616
{txt} 2.415 {res}     446      0      4      0.9448    0.0101     0.9211    0.9616
{txt} 2.416 {res}     442      1      0      0.9427    0.0103     0.9185    0.9598
{txt} 2.439 {res}     441      0      3      0.9427    0.0103     0.9185    0.9598
{txt} 2.442 {res}     438      0      2      0.9427    0.0103     0.9185    0.9598
{txt} 2.445 {res}     436      0      5      0.9427    0.0103     0.9185    0.9598
{txt} 2.448 {res}     431      0      3      0.9427    0.0103     0.9185    0.9598
{txt}  2.45 {res}     428      0      2      0.9427    0.0103     0.9185    0.9598
{txt} 2.453 {res}     426      0      5      0.9427    0.0103     0.9185    0.9598
{txt} 2.471 {res}     421      1      0      0.9404    0.0106     0.9159    0.9580
{txt} 2.472 {res}     420      1      0      0.9382    0.0108     0.9132    0.9561
{txt} 2.478 {res}     419      1      0      0.9360    0.0110     0.9106    0.9543
{txt}  2.48 {res}     418      0      4      0.9360    0.0110     0.9106    0.9543
{txt} 2.483 {res}     414      0      3      0.9360    0.0110     0.9106    0.9543
{txt} 2.486 {res}     411      0      9      0.9360    0.0110     0.9106    0.9543
{txt} 2.489 {res}     402      0     14      0.9360    0.0110     0.9106    0.9543
{txt}  2.49 {res}     388      0      1      0.9360    0.0110     0.9106    0.9543
{txt} 2.491 {res}     387      2      8      0.9311    0.0114     0.9048    0.9503
{txt} 2.494 {res}     377      1      7      0.9287    0.0117     0.9019    0.9483
{txt} 2.497 {res}     369      1      3      0.9261    0.0119     0.8989    0.9462
{txt}   2.5 {res}     365      0      5      0.9261    0.0119     0.8989    0.9462
{txt} 2.502 {res}     360      0      2      0.9261    0.0119     0.8989    0.9462
{txt} 2.505 {res}     358      0      3      0.9261    0.0119     0.8989    0.9462
{txt} 2.639 {res}     355      0      2      0.9261    0.0119     0.8989    0.9462
{txt} 2.642 {res}     353      0      8      0.9261    0.0119     0.8989    0.9462
{txt} 2.645 {res}     345      0      8      0.9261    0.0119     0.8989    0.9462
{txt} 2.648 {res}     337      1      7      0.9234    0.0122     0.8956    0.9440
{txt}  2.65 {res}     329      0      6      0.9234    0.0122     0.8956    0.9440
{txt} 2.653 {res}     323      0      6      0.9234    0.0122     0.8956    0.9440
{txt} 2.656 {res}     317      0      8      0.9234    0.0122     0.8956    0.9440
{txt} 2.667 {res}     309      0      1      0.9234    0.0122     0.8956    0.9440
{txt}  2.68 {res}     308      0      1      0.9234    0.0122     0.8956    0.9440
{txt} 2.682 {res}     307      1      1      0.9204    0.0125     0.8919    0.9416
{txt} 2.684 {res}     305      1      0      0.9174    0.0128     0.8882    0.9392
{txt} 2.715 {res}     304      1      0      0.9143    0.0131     0.8846    0.9367
{txt} 2.719 {res}     303      0      1      0.9143    0.0131     0.8846    0.9367
{txt} 2.721 {res}     302      0      1      0.9143    0.0131     0.8846    0.9367
{txt} 2.727 {res}     301      0      3      0.9143    0.0131     0.8846    0.9367
{txt}  2.73 {res}     298      0     14      0.9143    0.0131     0.8846    0.9367
{txt} 2.732 {res}     284      0      6      0.9143    0.0131     0.8846    0.9367
{txt} 2.735 {res}     278      0      4      0.9143    0.0131     0.8846    0.9367
{txt} 2.738 {res}     274      0      4      0.9143    0.0131     0.8846    0.9367
{txt} 2.741 {res}     270      0     13      0.9143    0.0131     0.8846    0.9367
{txt} 2.743 {res}     257      0      4      0.9143    0.0131     0.8846    0.9367
{txt} 2.746 {res}     253      0      5      0.9143    0.0131     0.8846    0.9367
{txt} 2.757 {res}     248      0      1      0.9143    0.0131     0.8846    0.9367
{txt} 2.793 {res}     247      0      1      0.9143    0.0131     0.8846    0.9367
{txt} 2.812 {res}     246      0      1      0.9143    0.0131     0.8846    0.9367
{txt} 2.815 {res}     245      0      7      0.9143    0.0131     0.8846    0.9367
{txt} 2.817 {res}     238      0      3      0.9143    0.0131     0.8846    0.9367
{txt} 2.823 {res}     235      0      2      0.9143    0.0131     0.8846    0.9367
{txt} 2.825 {res}     233      0      4      0.9143    0.0131     0.8846    0.9367
{txt} 2.828 {res}     229      0      4      0.9143    0.0131     0.8846    0.9367
{txt} 2.831 {res}     225      0      3      0.9143    0.0131     0.8846    0.9367
{txt} 2.834 {res}     222      0      1      0.9143    0.0131     0.8846    0.9367
{txt} 2.875 {res}     221      0      2      0.9143    0.0131     0.8846    0.9367
{txt} 2.899 {res}     219      0      1      0.9143    0.0131     0.8846    0.9367
{txt} 2.962 {res}     218      0      1      0.9143    0.0131     0.8846    0.9367
{txt} 2.965 {res}     217      0      8      0.9143    0.0131     0.8846    0.9367
{txt} 2.968 {res}     209      0      7      0.9143    0.0131     0.8846    0.9367
{txt} 2.971 {res}     202      0      9      0.9143    0.0131     0.8846    0.9367
{txt} 2.973 {res}     193      0     20      0.9143    0.0131     0.8846    0.9367
{txt} 2.976 {res}     173      0      8      0.9143    0.0131     0.8846    0.9367
{txt} 2.979 {res}     165      0      5      0.9143    0.0131     0.8846    0.9367
{txt} 2.982 {res}     160      0      3      0.9143    0.0131     0.8846    0.9367
{txt} 2.984 {res}     157      0      3      0.9143    0.0131     0.8846    0.9367
{txt}  2.99 {res}     154      0      2      0.9143    0.0131     0.8846    0.9367
{txt} 2.995 {res}     152      0      1      0.9143    0.0131     0.8846    0.9367
{txt} 3.001 {res}     151      0      1      0.9143    0.0131     0.8846    0.9367
{txt} 3.039 {res}     150      0      4      0.9143    0.0131     0.8846    0.9367
{txt} 3.042 {res}     146      0      2      0.9143    0.0131     0.8846    0.9367
{txt} 3.044 {res}     144      0      3      0.9143    0.0131     0.8846    0.9367
{txt} 3.047 {res}     141      0      4      0.9143    0.0131     0.8846    0.9367
{txt}  3.05 {res}     137      0      2      0.9143    0.0131     0.8846    0.9367
{txt} 3.053 {res}     135      0      3      0.9143    0.0131     0.8846    0.9367
{txt} 3.061 {res}     132      0      1      0.9143    0.0131     0.8846    0.9367
{txt} 3.072 {res}     131      0      2      0.9143    0.0131     0.8846    0.9367
{txt}  3.08 {res}     129      0      7      0.9143    0.0131     0.8846    0.9367
{txt} 3.083 {res}     122      0      4      0.9143    0.0131     0.8846    0.9367
{txt} 3.086 {res}     118      0      3      0.9143    0.0131     0.8846    0.9367
{txt} 3.088 {res}     115      0      3      0.9143    0.0131     0.8846    0.9367
{txt} 3.091 {res}     112      0      1      0.9143    0.0131     0.8846    0.9367
{txt} 3.113 {res}     111      0      1      0.9143    0.0131     0.8846    0.9367
{txt} 3.116 {res}     110      0      6      0.9143    0.0131     0.8846    0.9367
{txt} 3.118 {res}     104      0     12      0.9143    0.0131     0.8846    0.9367
{txt} 3.121 {res}      92      0      8      0.9143    0.0131     0.8846    0.9367
{txt} 3.143 {res}      84      0      1      0.9143    0.0131     0.8846    0.9367
{txt} 3.146 {res}      83      0      8      0.9143    0.0131     0.8846    0.9367
{txt} 3.149 {res}      75      0     13      0.9143    0.0131     0.8846    0.9367
{txt} 3.151 {res}      62      0     19      0.9143    0.0131     0.8846    0.9367
{txt} 3.157 {res}      43      0      1      0.9143    0.0131     0.8846    0.9367
{txt} 3.159 {res}      42      0      4      0.9143    0.0131     0.8846    0.9367
{txt} 3.162 {res}      38      0      8      0.9143    0.0131     0.8846    0.9367
{txt} 3.165 {res}      30      0     15      0.9143    0.0131     0.8846    0.9367
{txt} 3.168 {res}      15      0     10      0.9143    0.0131     0.8846    0.9367
{txt}  3.17 {res}       5      0      4      0.9143    0.0131     0.8846    0.9367
{txt}{hline 72}
{p 0 6 0 }Note: {help j_stslist_netlost:Net Lost} equals the number lost minus the number who entered.{p_end}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. sts graph, by(hyper)

         {txt}failure _d:  {res}died
   {txt}analysis time _t:  {res}(exit-origin)/365.25
             {txt}origin:  {res}time enter
{txt}  enter on or after:  {res}time enter
                 {txt}id:  {res}id
{txt}
{com}. 
{txt}end of do-file

{com}. graph export "/Users/chaoimacmini/Downloads/LSHTMlearningnote/img/plot3_15.jpg", as(jpg) name("Graph") quality(100)
{txt}(file /Users/chaoimacmini/Downloads/LSHTMlearningnote/img/plot3_15.jpg written in JPG format)

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. sts graph, by(hyper) ci

         {txt}failure _d:  {res}died
   {txt}analysis time _t:  {res}(exit-origin)/365.25
             {txt}origin:  {res}time enter
{txt}  enter on or after:  {res}time enter
                 {txt}id:  {res}id
{txt}
{com}. 
{txt}end of do-file

{com}. graph export "/Users/chaoimacmini/Downloads/LSHTMlearningnote/img/plot3_16.jpg", as(jpg) name("Graph") quality(90)
{txt}(file /Users/chaoimacmini/Downloads/LSHTMlearningnote/img/plot3_16.jpg written in JPG format)

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. sts graph, by(hyper) ci failure ylabel(0 0.05 0.10 0.15 0.20)

         {txt}failure _d:  {res}died
   {txt}analysis time _t:  {res}(exit-origin)/365.25
             {txt}origin:  {res}time enter
{txt}  enter on or after:  {res}time enter
                 {txt}id:  {res}id
{txt}
{com}. 
{txt}end of do-file

{com}. graph export "/Users/chaoimacmini/Downloads/LSHTMlearningnote/img/plot3_17.jpg", as(jpg) name("Graph") quality(100)
{txt}(file /Users/chaoimacmini/Downloads/LSHTMlearningnote/img/plot3_17.jpg written in JPG format)

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. sts test hyper

         {txt}failure _d:  {res}died
   {txt}analysis time _t:  {res}(exit-origin)/365.25
             {txt}origin:  {res}time enter
{txt}  enter on or after:  {res}time enter
                 {txt}id:  {res}id


{txt}{title:Log-rank test for equality of survivor functions}

{col 6} {c |}   Events         Events
hyper {c |}  observed       expected
{hline 6}{c +}{hline 25}
0     {c |}{res}        94         117.91
{txt}1     {c |}{res}        40          16.09
{txt}{hline 6}{c +}{hline 25}
Total {c |}{res}       134         134.00

            {txt}chi2(1) = {res}     40.36
            {txt}Pr>chi2 = {res}    0.0000
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. stset exit, failure(died) enter(enter)  id(id) scale(365.25)

                {txt}id:  {res}id
     {txt}failure event:  {res}died != 0 & died < .
{txt}obs. time interval:  {res}(exit[_n-1], exit]
{txt} enter on or after:  {res}time enter
{txt} exit on or before:  {res}failure
    {txt}t for analysis:  {res}time/365.25

{txt}{hline 78}
{res}      4,298{txt}  total observations
{res}          0{txt}  exclusions
{hline 78}
{res}      4,298{txt}  observations remaining, representing
{res}      4,298{txt}  subjects
{res}        137{txt}  failures in single-failure-per-subject data
{res} 11,457.357{txt}  total analysis time at risk and under observation
                                                at risk from t = {res}        0
                                     {txt}earliest observed entry t = {res} 28.94182
                                          {txt}last observed exit t = {res} 32.21355
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. strate hyper, per(1000)

         {txt}failure _d:  {res}died
   {txt}analysis time _t:  {res}exit/365.25
{txt}  enter on or after:  {res}time enter
                 {txt}id:  {res}id

{txt}Estimated failure rates
Number of records  =       {res}4263
{txt}
  {c TLC}{hline 7}{c -}{hline 4}{c -}{hline 8}{c -}{hline 9}{c -}{hline 9}{c -}{hline 9}{c TRC}
  {c |} {res}hyper    D        Y      Rate     Lower     Upper {txt}{c |}
  {c LT}{hline 7}{c -}{hline 4}{c -}{hline 8}{c -}{hline 9}{c -}{hline 9}{c -}{hline 9}{c RT}
  {c |} {res}    0   94   9.9879    9.4114    7.6888   11.5199 {txt}{c |}
  {c |} {res}    1   40   1.3819   28.9456   21.2322   39.4611 {txt}{c |}
  {c BLC}{hline 7}{c -}{hline 4}{c -}{hline 8}{c -}{hline 9}{c -}{hline 9}{c -}{hline 9}{c BRC}
   Notes: Rate = D/Y = failures/person-time (per 1000).
          Lower and Upper are bounds of 95% confidence intervals.


{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. stmh hyper

         {txt}failure _d:  {res}died
   {txt}analysis time _t:  {res}exit/365.25
{txt}  enter on or after:  {res}time enter
                 {txt}id:  {res}id

{txt}Mantel-Haenszel estimate of the rate ratio
  comparing {res}hyper==1{txt} vs. {res}hyper==0

{txt}{col 1}{hline 72}
    Rate ratio         chi2         P>chi2          [95% Conf. Interval]
{col 1}{hline 72}
    {res}     3.076        39.30         0.0000              2.124      4.453
{txt}{col 1}{hline 72}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. sts graph, by(hyper)

         {txt}failure _d:  {res}died
   {txt}analysis time _t:  {res}exit/365.25
{txt}  enter on or after:  {res}time enter
                 {txt}id:  {res}id
{txt}
{com}. 
{txt}end of do-file

{com}. graph export "/Users/chaoimacmini/Downloads/LSHTMlearningnote/img/plot3_19.jpg", as(jpg) name("Graph") quality(100)
{txt}(file /Users/chaoimacmini/Downloads/LSHTMlearningnote/img/plot3_19.jpg written in JPG format)

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/sme3.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}23 Aug 2021, 23:40:26
{txt}{.-}
{smcl}
{txt}{sf}{ul off}