{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/sme6.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}23 Aug 2021, 23:49:02
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. log using sme6, append
{err}log file already open
{txt}{search r(604), local:r(604);}

end of do-file

{search r(604), local:r(604);}

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. use mwanza
{err}no; dataset in memory has changed since last saved
{txt}{search r(4), local:r(4);}

end of do-file

{search r(4), local:r(4);}

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. use mwanza, replace
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD16921.000000"
{txt}
{com}. 
. help mwanza
{txt}
{com}. 
{txt}end of do-file

{com}. {smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/sme6.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 8 Sep 2021, 23:46:17
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. cd "~/Downloads/LSHTMlearningnote/backupfiles/"
{res}/Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. use mwanza, replace
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. help mwanza
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. generate ed2 = ed
{txt}
{com}. recode ed2 3/4 = 2
{txt}(ed2: 376 changes made)

{com}. label define ed2label 1 "none/adult only" 2 ">=1 years"
{txt}
{com}. label val ed2 ed2label
{txt}
{com}. label var ed2 "education"
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. tabulate ed2 ed

                {txt}{c |}                  Education
      education {c |}         1          2          3          4 {c |}     Total
{hline 16}{c +}{hline 44}{c +}{hline 10}
none/adult only {c |}{res}       312          0          0          0 {txt}{c |}{res}       312 
{txt}      >=1 years {c |}{res}         0         75        365         11 {txt}{c |}{res}       451 
{txt}{hline 16}{c +}{hline 44}{c +}{hline 10}
          Total {c |}{res}       312         75        365         11 {txt}{c |}{res}       763 
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. generate age2 = age1
{txt}
{com}. recode age2 2 = 1 3/4 = 2 5/6 = 3
{txt}(age2: 654 changes made)

{com}. label define age2label 1 "15-24" 2 "25-34" 3 "35+"
{txt}
{com}. label val age2 age2label
{txt}
{com}. label var age2 "Age"
{txt}
{com}. tabulate age2 age1

           {txt}{c |}                             Age group
       Age {c |}         1          2          3          4          5          6 {c |}     Total
{hline 11}{c +}{hline 66}{c +}{hline 10}
     15-24 {c |}{res}       109        165          0          0          0          0 {txt}{c |}{res}       274 
{txt}     25-34 {c |}{res}         0          0        123        118          0          0 {txt}{c |}{res}       241 
{txt}       35+ {c |}{res}         0          0          0          0        137        111 {txt}{c |}{res}       248 
{txt}{hline 11}{c +}{hline 66}{c +}{hline 10}
     Total {c |}{res}       109        165        123        118        137        111 {txt}{c |}{res}       763 
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
.  tabulate case ed2, row
{txt}
{c TLC}{hline 16}{c TRC}
{c |} Key{col 18}{c |}
{c LT}{hline 16}{c RT}
{c |}{space 3}{it:frequency}{col 18}{c |}
{c |}{space 1}{it:row percentage}{col 18}{c |}
{c BLC}{hline 16}{c BRC}

Case/contr {c |}       education
        ol {c |} none/adul  >=1 years {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}       263        311 {txt}{c |}{res}       574 
           {txt}{c |}{res}     45.82      54.18 {txt}{c |}{res}    100.00 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         1 {c |}{res}        49        140 {txt}{c |}{res}       189 
           {txt}{c |}{res}     25.93      74.07 {txt}{c |}{res}    100.00 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       312        451 {txt}{c |}{res}       763 
           {txt}{c |}{res}     40.89      59.11 {txt}{c |}{res}    100.00 
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
.  mhodds case ed2, c(1, 2)

{txt}Maximum likelihood estimate of the odds ratio
Comparing ed2==1 vs. ed2==2
{res}
{txt}{col 5}{hline 64}
     Odds Ratio    chi2(1)        P>chi2        [95% Conf. Interval]
{col 5}{hline 64}
     {res}  0.413878      23.25        0.0000         0.285782   0.599391
{txt}{col 5}{hline 64}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
.  mhodds case ed2, c(2, 1)

{txt}Maximum likelihood estimate of the odds ratio
Comparing ed2==2 vs. ed2==1
{res}
{txt}{col 5}{hline 64}
     Odds Ratio    chi2(1)        P>chi2        [95% Conf. Interval]
{col 5}{hline 64}
     {res}  2.416169      23.25        0.0000         1.668360   3.499168
{txt}{col 5}{hline 64}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. tab case ed2, chi exact

{txt}Case/contr {c |}       education
        ol {c |} none/adul  >=1 years {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}       263        311 {txt}{c |}{res}       574 
{txt}         1 {c |}{res}        49        140 {txt}{c |}{res}       189 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       312        451 {txt}{c |}{res}       763 

{txt}          Pearson chi2({res}1{txt}) = {res} 23.2789  {txt} Pr = {res}0.000
{txt}           Fisher's exact =                 {res}0.000
{txt}   1-sided Fisher's exact =                 {res}0.000
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. bysort age2: tab case ed2, row

{txt}{hline}
-> age2 = 15-24

{c TLC}{hline 16}{c TRC}
{c |} Key{col 18}{c |}
{c LT}{hline 16}{c RT}
{c |}{space 3}{it:frequency}{col 18}{c |}
{c |}{space 1}{it:row percentage}{col 18}{c |}
{c BLC}{hline 16}{c BRC}

Case/contr {c |}       education
        ol {c |} none/adul  >=1 years {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}        37        167 {txt}{c |}{res}       204 
           {txt}{c |}{res}     18.14      81.86 {txt}{c |}{res}    100.00 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         1 {c |}{res}        13         57 {txt}{c |}{res}        70 
           {txt}{c |}{res}     18.57      81.43 {txt}{c |}{res}    100.00 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}        50        224 {txt}{c |}{res}       274 
           {txt}{c |}{res}     18.25      81.75 {txt}{c |}{res}    100.00 

{txt}{hline}
-> age2 = 25-34

{c TLC}{hline 16}{c TRC}
{c |} Key{col 18}{c |}
{c LT}{hline 16}{c RT}
{c |}{space 3}{it:frequency}{col 18}{c |}
{c |}{space 1}{it:row percentage}{col 18}{c |}
{c BLC}{hline 16}{c BRC}

Case/contr {c |}       education
        ol {c |} none/adul  >=1 years {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}        79         90 {txt}{c |}{res}       169 
           {txt}{c |}{res}     46.75      53.25 {txt}{c |}{res}    100.00 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         1 {c |}{res}        11         61 {txt}{c |}{res}        72 
           {txt}{c |}{res}     15.28      84.72 {txt}{c |}{res}    100.00 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}        90        151 {txt}{c |}{res}       241 
           {txt}{c |}{res}     37.34      62.66 {txt}{c |}{res}    100.00 

{txt}{hline}
-> age2 = 35+

{c TLC}{hline 16}{c TRC}
{c |} Key{col 18}{c |}
{c LT}{hline 16}{c RT}
{c |}{space 3}{it:frequency}{col 18}{c |}
{c |}{space 1}{it:row percentage}{col 18}{c |}
{c BLC}{hline 16}{c BRC}

Case/contr {c |}       education
        ol {c |} none/adul  >=1 years {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}       147         54 {txt}{c |}{res}       201 
           {txt}{c |}{res}     73.13      26.87 {txt}{c |}{res}    100.00 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         1 {c |}{res}        25         22 {txt}{c |}{res}        47 
           {txt}{c |}{res}     53.19      46.81 {txt}{c |}{res}    100.00 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       172         76 {txt}{c |}{res}       248 
           {txt}{c |}{res}     69.35      30.65 {txt}{c |}{res}    100.00 

{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. mhodds case 3d2, by(age2)
{err}3d2 invalid name
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. mhodds case ed2, by(age2)

{txt}Maximum likelihood estimate of the odds ratio
Comparing ed2==2 vs. ed2==1
by age2

{hline 10}{c TT}{hline 68}
     age2 {c |} Odds Ratio        chi2(1)         P>chi2       [95% Conf. Interval]
{hline 10}{c +}{hline 68}
    15-24 {c |} {res}  0.971442           0.01         0.9354         0.48188    1.95837
    {txt}25-34 {c |} {res}  4.867677          21.28         0.0000         2.31121   10.25188
      {txt}35+ {c |} {res}  2.395556           7.10         0.0077         1.23412    4.65001
{txt}{hline 10}{c BT}{hline 68}

    Mantel-Haenszel estimate controlling for age2
{col 5}{hline 64}
     Odds Ratio    chi2(1)        P>chi2        [95% Conf. Interval]
{col 5}{hline 64}
     {res}  2.330972      19.46        0.0000         1.582460   3.433536
{txt}{col 5}{hline 64}

Test of homogeneity of ORs (approx): chi2({res}2{txt})   ={res}   10.31
                                     {txt}Pr>chi2   =  {res}0.0058
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. recode rel 9=.
{txt}(rel: 1 changes made)

{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. tabulate case rel, chi row
{txt}
{c TLC}{hline 16}{c TRC}
{c |} Key{col 18}{c |}
{c LT}{hline 16}{c RT}
{c |}{space 3}{it:frequency}{col 18}{c |}
{c |}{space 1}{it:row percentage}{col 18}{c |}
{c BLC}{hline 16}{c BRC}

Case/contr {c |}                  Religion
        ol {c |}         1          2          3          4 {c |}     Total
{hline 11}{c +}{hline 44}{c +}{hline 10}
         0 {c |}{res}        28        228        150        167 {txt}{c |}{res}       573 
           {txt}{c |}{res}      4.89      39.79      26.18      29.14 {txt}{c |}{res}    100.00 
{txt}{hline 11}{c +}{hline 44}{c +}{hline 10}
         1 {c |}{res}        20         93         55         21 {txt}{c |}{res}       189 
           {txt}{c |}{res}     10.58      49.21      29.10      11.11 {txt}{c |}{res}    100.00 
{txt}{hline 11}{c +}{hline 44}{c +}{hline 10}
     Total {c |}{res}        48        321        205        188 {txt}{c |}{res}       762 
           {txt}{c |}{res}      6.30      42.13      26.90      24.67 {txt}{c |}{res}    100.00 

{txt}          Pearson chi2({res}3{txt}) = {res} 29.4949  {txt} Pr = {res}0.000
{txt}
{com}. 
{txt}end of do-file

{com}. 