---------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/sme8.log
  log type:  text
 opened on:  15 Sep 2021, 23:35:57

. 
end of do-file

. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD05303.000000"

. cd "~/Downloads/LSHTMlearningnote/backupfiles/"
/Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles

. 
end of do-file

. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD05303.000000"

. 
. bloglik 4 6
Most likely value for risk parameter    0.40000

cut-point -1.921
Likelihood based limits for risk parameter  0.14562  0.70004
Approx quadratic limits for risk parameter  0.09634  0.70366

. 
end of do-file

. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD05303.000000"

. 
. bloglik 2 18
Most likely value for risk parameter    0.10000

cut-point -1.921
Likelihood based limits for risk parameter  0.01736  0.27796
Approx quadratic limits for risk parameter  -0.03149  0.23149

. 
end of do-file

. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD05303.000000"

. 
. bloglike 2 18, logodds
command bloglike is unrecognized
r(199);

end of do-file

r(199);

. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD05303.000000"

. 
. bloglik 2 18, logodds
Most likely value for logodds parameter    -2.19722

cut-point -1.921
Likelihood based limits for logodds parameter  -4.03622  -0.95459
Approx quadratic limits for logodds parameter  -3.65820  -0.73625

Back on original risk scale
Most likely value for risk parameter    0.10000
Likelihood based limits for risk parameter  0.01736  0.27796
Approx quadratic limits for risk parameter  0.02513  0.32382

. 
end of do-file

. graph export "/Users/chaoimacmini/Downloads/LSHTMlearningnote/img/logoddslikelihood.jpg", as(jpg)
>  name("Graph") quality(100)
(file /Users/chaoimacmini/Downloads/LSHTMlearningnote/img/logoddslikelihood.jpg written in JPG form
> at)

. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD05303.000000"

. 
. ploglik 7 500

ALL RATES PER    1000
Most likely value for rate parameter      14.00

cut-point -1.921
Likelihood based limits for rate parameter     6.02    27.08
Approx quadratic limits for rate parameter     3.63    24.37

. 
end of do-file

. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD05303.000000"

. bloglik 2 18
Most likely value for risk parameter    0.10000

cut-point -1.921
Likelihood based limits for risk parameter  0.01736  0.27796
Approx quadratic limits for risk parameter  -0.03149  0.23149

. 
end of do-file

. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD05303.000000"

. ploglik 7 500, lograte

ALL RATES PER    1000
Most likely value for log rate parameter       2.64

cut-point -1.921
Likelihood based limits for log rate parameter     1.79     3.30
Approx quadratic limits for log rate parameter     1.90     3.38

Back on original rate scale
Most likely value for rate parameter      14.00
Likelihood based limits for rate parameter     6.02    27.08
Approx quadratic limits for rate parameter     6.67    29.37

. 
end of do-file

. graph export "/Users/chaoimacmini/Downloads/LSHTMlearningnote/img/logratelikelihood.jpg", as(jpg)
>  name("Graph") quality(100)
(file /Users/chaoimacmini/Downloads/LSHTMlearningnote/img/logratelikelihood.jpg written in JPG form
> at)

. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD05303.000000"

. 
. ploglik 1 1000

ALL RATES PER    1000
Most likely value for rate parameter       1.00

cut-point -1.921
Likelihood based limits for rate parameter     0.06     4.40
Approx quadratic limits for rate parameter    -0.96     2.96

. 
end of do-file

. graph export "/Users/chaoimacmini/Downloads/LSHTMlearningnote/img/rate1000likelihood.jpg", as(jpg
> ) name("Graph") quality(100)
(file /Users/chaoimacmini/Downloads/LSHTMlearningnote/img/rate1000likelihood.jpg written in JPG for
> mat)

. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD05303.000000"

. ploglik 1 1000, lograte

ALL RATES PER    1000
Most likely value for log rate parameter       0.00

cut-point -1.921
Likelihood based limits for log rate parameter    -2.86     1.48
Approx quadratic limits for log rate parameter    -1.96     1.96

Back on original rate scale
Most likely value for rate parameter       1.00
Likelihood based limits for rate parameter     0.06     4.40
Approx quadratic limits for rate parameter     0.14     7.10

. 
end of do-file

. graph export "/Users/chaoimacmini/Downloads/LSHTMlearningnote/img/lograte1000likelihood.jpg", as(
> jpg) name("Graph") quality(100)
(file /Users/chaoimacmini/Downloads/LSHTMlearningnote/img/lograte1000likelihood.jpg written in JPG 
> format)

. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD05303.000000"

. 
. 
. 
. log close
      name:  <unnamed>
       log:  /Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/sme8.log
  log type:  text
 closed on:  16 Sep 2021, 16:18:51
---------------------------------------------------------------------------------------------------
