{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles/sme8.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}14 Sep 2021, 14:49:17
{txt}
{com}. 
. cd "~/Downloads/LSHTMlearningnote/backupfiles/"
{res}/Users/chaoimacmini/Downloads/LSHTMlearningnote/backupfiles
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. blik 4 6
{txt}Most likely value for pi    {res}0.40000
{txt}Likelihood based limits for pi  {res}0.14564  0.70002
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. blik 4 6, samex
{txt}Most likely value for pi    {res}0.40000
{txt}Likelihood based limits for pi  {res}0.14564  0.70002
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. blik 40 60, samex
{txt}Most likely value for pi    {res}0.40000
{txt}Likelihood based limits for pi  {res}0.30741  0.49765
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. blik 400 600, samex
{txt}Most likely value for pi    {res}0.40000
{txt}Likelihood based limits for pi  {res}0.36992  0.43059
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. blik 4 6, samex
{txt}Most likely value for pi    {res}0.40000
{txt}Likelihood based limits for pi  {res}0.14564  0.70002
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. blik 4 6, samex
{txt}Most likely value for pi    {res}0.40000
{txt}Likelihood based limits for pi  {res}0.14564  0.70002
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. blik 400 600, samex
{txt}Most likely value for pi    {res}0.40000
{txt}Likelihood based limits for pi  {res}0.36992  0.43059
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. blik 40 60, samex
{txt}Most likely value for pi    {res}0.40000
{txt}Likelihood based limits for pi  {res}0.30741  0.49765
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. blik 400 600, samex
{txt}Most likely value for pi    {res}0.40000
{txt}Likelihood based limits for pi  {res}0.36992  0.43059
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. blik 40 60, samex
{txt}Most likely value for pi    {res}0.40000
{txt}Likelihood based limits for pi  {res}0.30741  0.49765
{txt}cut-point {res}.1465
{txt}
{com}. 
. blik 400 600, samex
{txt}Most likely value for pi    {res}0.40000
{txt}Likelihood based limits for pi  {res}0.36992  0.43059
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. blik 40 60, samex
{txt}Most likely value for pi    {res}0.40000
{txt}Likelihood based limits for pi  {res}0.30741  0.49765
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. blik 4 6, samex
{txt}Most likely value for pi    {res}0.40000
{txt}Likelihood based limits for pi  {res}0.14564  0.70002
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. 
. blik 4 6, samex
{txt}Most likely value for pi    {res}0.40000
{txt}Likelihood based limits for pi  {res}0.14564  0.70002
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. blik 40 60, samex cut(0.2585)
{txt}Most likely value for pi    {res}0.40000
{txt}Likelihood based limits for pi  {res}0.32174  0.48184
{txt}cut-point {res}.2585
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. blik 1 9, samex
{txt}Most likely value for pi    {res}0.10000
{txt}Likelihood based limits for pi  {res}0.00599  0.37163
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. blik 0 10, samex1
{err}option {bf:samex1} not allowed
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. blik 0 10, samex
{txt}Most likely value for pi    {res}0.00000
{txt}Likelihood based limits for pi  {res}0.00000  0.17475
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. blik 0 100, samex
{txt}Most likely value for pi    {res}0.00000
{txt}Likelihood based limits for pi  {res}0.00000  0.01902
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. blik 0 1000, samex
{txt}Most likely value for pi    {res}0.00000
{txt}Likelihood based limits for pi  {res}0.00000  0.00192
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. plik 7 500

{txt}ALL RATES PER {res}   1000
{txt}Most likely value for lambda    {res}   14.0
{txt}Likelihood based limits for lambda  {res}    6.0     27.1
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. plik 70 5000

{txt}ALL RATES PER {res}   1000
{txt}Most likely value for lambda    {res}   14.0
{txt}Likelihood based limits for lambda  {res}   11.0     17.5
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. plik 700 50000

{txt}ALL RATES PER {res}   1000
{txt}Most likely value for lambda    {res}   14.0
{txt}Likelihood based limits for lambda  {res}   13.0     15.1
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. help plik
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. plik 7 500

{txt}ALL RATES PER {res}   1000
{txt}Most likely value for lambda    {res}   14.0
{txt}Likelihood based limits for lambda  {res}    6.0     27.1
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. * Q5 
. 
. plik 7 500

{txt}ALL RATES PER {res}   1000
{txt}Most likely value for lambda    {res}   14.0
{txt}Likelihood based limits for lambda  {res}    6.0     27.1
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. plik 7 500

{txt}ALL RATES PER {res}   1000
{txt}Most likely value for lambda    {res}   14.0
{txt}Likelihood based limits for lambda  {res}    6.0     27.1
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. plik 7 500

{txt}ALL RATES PER {res}   1000
{txt}Most likely value for lambda    {res}   14.0
{txt}Likelihood based limits for lambda  {res}    6.0     27.1
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. plik 70 5000

{txt}ALL RATES PER {res}   1000
{txt}Most likely value for lambda    {res}   14.0
{txt}Likelihood based limits for lambda  {res}   11.0     17.5
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. plik 700 50000

{txt}ALL RATES PER {res}   1000
{txt}Most likely value for lambda    {res}   14.0
{txt}Likelihood based limits for lambda  {res}   13.0     15.1
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. plik 7 50000

{txt}ALL RATES PER {res}   1000
{txt}Most likely value for lambda    {res}    0.1
{txt}Likelihood based limits for lambda  {res}    0.1      0.3
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. plik 1 500

{txt}ALL RATES PER {res}   1000
{txt}Most likely value for lambda    {res}    2.0
{txt}Likelihood based limits for lambda  {res}    0.1      8.8
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. plik 1 5000

{txt}ALL RATES PER {res}   1000
{txt}Most likely value for lambda    {res}    0.2
{txt}Likelihood based limits for lambda  {res}    0.0      0.9
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. plik 0 500

{txt}ALL RATES PER {res}   1000
{txt}Most likely value for lambda    {res}    0.0
{txt}Likelihood based limits for lambda  {res}    0.0  3.84146
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. blik 15 10, null(0.5) pval
{txt}Most likely value for pi  {res}0.60000
{txt}Null value for pi         {res}0.50000
{txt}Lik ratio for null value          {res}0.60448
{txt}Approx pvalue   {res}0.3157
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. plik 4999 5000

{txt}ALL RATES PER {res}   1000
{txt}Most likely value for lambda    {res}  999.8
{txt}Likelihood based limits for lambda  {res}  972.3   1027.8
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. plik 5000 5000

{txt}ALL RATES PER {res}   1000
{txt}Most likely value for lambda    {res} 1000.0
{txt}Likelihood based limits for lambda  {res}  972.5   1028.0
{txt}cut-point {res}.1465
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. blik 15 10, null(0.5) pval
{txt}Most likely value for pi  {res}0.60000
{txt}Null value for pi         {res}0.50000
{txt}Lik ratio for null value          {res}0.60448
{txt}Approx pvalue   {res}0.3157
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. blik 15 10, null(0.5) pval
{txt}Most likely value for pi  {res}0.60000
{txt}Null value for pi         {res}0.50000
{txt}Lik ratio for null value          {res}0.60448
{txt}Approx pvalue   {res}0.3157
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. blik 24 16, null(0.5) pval
{txt}Most likely value for pi  {res}0.60000
{txt}Null value for pi         {res}0.50000
{txt}Lik ratio for null value          {res}0.44690
{txt}Approx pvalue   {res}0.2044
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/hv/m2nrhp7j4gd53fjvf985xgy80000gn/T//SD26261.000000"
{txt}
{com}. 
. blik 36 24, null(0.5) pval
{txt}Most likely value for pi  {res}0.60000
{txt}Null value for pi         {res}0.50000
{txt}Lik ratio for null value          {res}0.29876
{txt}Approx pvalue   {res}0.1201
{txt}
{com}. 
{txt}end of do-file

{com}. 